Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official NUCLEO-F401RE.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL         |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |USART1|USART2|USART6|ADC1 |TIM (PWM)                    |USB       |SDIO|RCC       |SYS        
PA0 , // |                    |    |    |    |     |     |     |      |      |      |*IN0 |*TIM5_CH1 *TIM2_CH1          |          |    |          |           
PA1 , // |                    |    |    |    |     |     |     |      |      |      |*IN1 |*TIM5_CH2 *TIM2_CH2          |          |    |          |           
PA2 , // |USART_TX            |    |    |    |     |     |     |      |*TX   |      |*IN2 |*TIM5_CH3 *TIM9_CH1 *TIM2_CH3|          |    |          |           
PA3 , // |USART_RX            |    |    |    |     |     |     |      |*RX   |      |*IN3 |*TIM5_CH4 *TIM9_CH2 *TIM2_CH4|          |    |          |           
PA4 , // |                    |    |    |    |     |     |     |      |      |      |*IN4 |                             |          |    |          |           
PA5 , // |LD2 [Green Led]     |    |    |    |*SCK |     |     |      |      |      |*IN5 |+TIM2_CH1                    |          |    |          |           
PA6 , // |                    |    |    |    |*MISO|     |     |      |      |      |*IN6 |*TIM3_CH1                    |          |    |          |           
PA7 , // |                    |    |    |    |*MOSI|     |     |      |      |      |*IN7 |*TIM1_CH1N *TIM3_CH2         |          |    |          |           
PA8 , // |                    |    |    |*SCL|     |     |     |      |      |      |     |*TIM1_CH1                    |          |    |          |           
PA9 , // |                    |    |    |    |     |     |     |*TX   |      |      |     |*TIM1_CH2                    |          |    |          |           
PA10, // |                    |    |    |    |     |     |     |*RX   |      |      |     |*TIM1_CH3                    |          |    |          |           
PA11, // |                    |    |    |    |     |     |     |      |      |+TX   |     |*TIM1_CH4                    |*OTG_FS_DM|    |          |           
PA12, // |                    |    |    |    |     |     |     |      |      |+RX   |     |                             |*OTG_FS_DP|    |          |           
PA13, // |TMS                 |    |    |    |     |     |     |      |      |      |     |                             |          |    |          |*JTMS-SWDIO
PA14, // |TCK                 |    |    |    |     |     |     |      |      |      |     |                             |          |    |          |*JTCK-SWCLK
PA15, // |                    |    |    |    |     |     |     |      |      |      |     |+TIM2_CH1                    |          |    |          |*JTDI      
PB0 , // |                    |    |    |    |     |     |     |      |      |      |*IN8 |*TIM3_CH3 *TIM1_CH2N         |          |    |          |           
PB1 , // |                    |    |    |    |     |     |     |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N         |          |    |          |           
PB2 , // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |    |          |           
PB3 , // |SWO                 |    |*SDA|    |+SCK |     |+SCK |      |      |      |     |+TIM2_CH2                    |          |    |          |*JTDO-SWO  
PB4 , // |                    |    |    |+SDA|+MISO|     |+MISO|      |      |      |     |+TIM3_CH1                    |          |    |          |*JTRST     
PB5 , // |                    |    |    |    |+MOSI|     |+MOSI|      |      |      |     |+TIM3_CH2                    |          |    |          |           
PB6 , // |                    |*SCL|    |    |     |     |     |+TX   |      |      |     |*TIM4_CH1                    |          |    |          |           
PB7 , // |                    |*SDA|    |    |     |     |     |+RX   |      |      |     |*TIM4_CH2                    |          |    |          |           
PB8 , // |                    |+SCL|    |    |     |     |     |      |      |      |     |*TIM10_CH1 *TIM4_CH3         |          |*D4 |          |           
PB9 , // |                    |+SDA|    |    |     |     |     |      |      |      |     |*TIM4_CH4 *TIM11_CH1         |          |*D5 |          |           
PB10, // |                    |    |*SCL|    |     |*SCK |     |      |      |      |     |+TIM2_CH3                    |          |    |          |           
PB12, // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |    |          |           
PB13, // |                    |    |    |    |     |+SCK |     |      |      |      |     |+TIM1_CH1N                   |          |    |          |           
PB14, // |                    |    |    |    |     |+MISO|     |      |      |      |     |+TIM1_CH2N                   |          |    |          |           
PB15, // |                    |    |    |    |     |+MOSI|     |      |      |      |     |+TIM1_CH3N                   |          |    |          |           
PC0 , // |                    |    |    |    |     |     |     |      |      |      |*IN10|                             |          |    |          |           
PC1 , // |                    |    |    |    |     |     |     |      |      |      |*IN11|                             |          |    |          |           
PC2 , // |                    |    |    |    |     |*MISO|     |      |      |      |*IN12|                             |          |    |          |           
PC3 , // |                    |    |    |    |     |*MOSI|     |      |      |      |*IN13|                             |          |    |          |           
PC4 , // |                    |    |    |    |     |     |     |      |      |      |*IN14|                             |          |    |          |           
PC5 , // |                    |    |    |    |     |     |     |      |      |      |*IN15|                             |          |    |          |           
PC6 , // |                    |    |    |    |     |     |     |      |      |*TX   |     |+TIM3_CH1                    |          |*D6 |          |           
PC7 , // |                    |    |    |    |     |     |     |      |      |*RX   |     |+TIM3_CH2                    |          |*D7 |          |           
PC8 , // |                    |    |    |    |     |     |     |      |      |      |     |+TIM3_CH3                    |          |*D0 |          |           
PC9 , // |                    |    |    |*SDA|     |     |     |      |      |      |     |+TIM3_CH4                    |          |*D1 |          |           
PC10, // |                    |    |    |    |     |     |*SCK |      |      |      |     |                             |          |*D2 |          |           
PC11, // |                    |    |    |    |     |     |*MISO|      |      |      |     |                             |          |*D3 |          |           
PC12, // |                    |    |    |    |     |     |*MOSI|      |      |      |     |                             |          |*CK |          |           
PC13, // |B1 [Blue PushButton]|    |    |    |     |     |     |      |      |      |     |                             |          |    |          |           
PC14, // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |    |*OSC32_IN |           
PC15, // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |    |*OSC32_OUT|           
PD2 , // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |*CMD|          |           
PH0 , // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |    |*OSC_IN   |           
PH1 , // |                    |    |    |    |     |     |     |      |      |      |     |                             |          |    |*OSC_OUT  |           
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_10, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI3, 
    .mosi_alternate = GPIO_AF6_SPI3,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_12, 
    .miso_alternate = GPIO_AF6_SPI3,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_11, 
    .sck_alternate = GPIO_AF6_SPI3,
    .sck_port = GPIOC, 
    .sck_pin = GPIO_PIN_10, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C1,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_7,
    .scl_alternate = GPIO_AF4_I2C1,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_6,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF9_I2C2,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_3,
    .scl_alternate = GPIO_AF4_I2C2,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_10,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C3,
    .irq = I2C3_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C3,
    .sda_port = GPIOC,
    .sda_pin = GPIO_PIN_9,
    .scl_alternate = GPIO_AF4_I2C3,
    .scl_port = GPIOA,
    .scl_pin = GPIO_PIN_8,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


uart_conf_t g_uart_config[] = {
  {
    //UART ID and IRQ
    .usart_typedef = USART1, .irqtype = USART1_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_9,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_10,
    .uart_af_remap = GPIO_AF7_USART1,
    .tx_alternate  = GPIO_AF7_USART1,
    .rx_alternate  = GPIO_AF7_USART1,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART2, .irqtype = USART2_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_2,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_3,
    .uart_af_remap = GPIO_AF7_USART2,
    .tx_alternate  = GPIO_AF7_USART2,
    .rx_alternate  = GPIO_AF7_USART2,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART6, .irqtype = USART6_IRQn,
    .tx_port = GPIOC, .tx_pin = GPIO_PIN_6,
    .rx_port = GPIOC, .rx_pin = GPIO_PIN_7,
    .uart_af_remap = GPIO_AF8_USART6,
    .tx_alternate  = GPIO_AF8_USART6,
    .rx_alternate  = GPIO_AF8_USART6,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
};

uint8_t NB_UART_MANAGED = sizeof(g_uart_config) / sizeof(g_uart_config[0]);

UART_HandleTypeDef g_UartHandle[sizeof(g_uart_config) / sizeof(g_uart_config[0])];


#define SAMPLINGTIME  ADC_SAMPLETIME_1CYCLE_5  /*!< ADC conversions sampling time. */

adc_config_str g_adc_config[] = {
  {
    .port = GPIOA,
    .pin = GPIO_PIN_0,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_0, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_1,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_1, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOC,
    .pin = GPIO_PIN_0,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_10, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOC,
    .pin = GPIO_PIN_1,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_11, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOC,
    .pin = GPIO_PIN_2,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_12, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOC,
    .pin = GPIO_PIN_3,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_13, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOC,
    .pin = GPIO_PIN_4,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_14, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOC,
    .pin = GPIO_PIN_5,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_15, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_2,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_2, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_3,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_3, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_4,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_4, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_5,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_5, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_6,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_6, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOA,
    .pin = GPIO_PIN_7,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_7, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOB,
    .pin = GPIO_PIN_0,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_8, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
  {
    .port = GPIOB,
    .pin = GPIO_PIN_1,
    .adcInstance = ADC1,
    .adcChannelConf = { .Channel = ADC_CHANNEL_9, .Rank = ADC_REGULAR_RANK_1, .SamplingTime = SAMPLINGTIME }
  },
};
